{ lib, ... }:
{
  plugins.alpha.enable = true;

  plugins.alpha.settings = {
    layout = [
      {
        type = "padding";
        val = 2;
      }
      {
        opts = {
          hl = "Type";
          position = "center";
        };
        type = "text";
        val = [
          "████████╗ █████╗  ██████╗ ██╗     ██╗ █████╗ ██╗   ██╗██╗███╗   ███╗"
          "╚══██╔══╝██╔══██╗██╔════╝ ██║     ██║██╔══██╗██║   ██║██║████╗ ████║"
          "   ██║   ███████║██║  ███╗██║     ██║███████║██║   ██║██║██╔████╔██║"
          "   ██║   ██╔══██║██║   ██║██║     ██║██╔══██║╚██╗ ██╔╝██║██║╚██╔╝██║"
          "   ██║   ██║  ██║╚██████╔╝███████╗██║██║  ██║ ╚████╔╝ ██║██║ ╚═╝ ██║"
          "   ╚═╝   ╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚═╝╚═╝  ╚═╝  ╚═══╝  ╚═╝╚═╝     ╚═╝"

        ];
      }
      {
        type = "padding";
        val = 2;
      }
      {
        type = "padding";
        val = 2;
      }
      {
        opts = {
          hl = "Keyword";
          position = "center";
        };
        type = "text";
        val = "Always remember: sometimes left is right, and right is wrong...";
      }
    ];
  };
}
